Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [12]:
import pandas as pd

data=[4,8,15,16,23,42]

series=pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it.

In [13]:
l=[1,2,3,4,5,6,7,8,9,10]
print(type(l))#just to check the type
mylist_series=pd.Series(l)
print(mylist_series)

<class 'list'>
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

Name                        Age                             Gender
Alice                       25                              Female
Bob                         30                              Male
Claire                      27                              Female

Then, print the DataFrame.

In [14]:
data= {"Name":['Alice','Bob','Claire'],
      'Age':[25,30,27],
      'Gender': ['Female','Male','Female']}

my_dataframe=pd.DataFrame(data)
print(my_dataframe)
type(my_dataframe)#just to check the type

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

pandas.core.frame.DataFrame

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional tabular data structure, consisting of rows and columns, similar to a spreadsheet or SQL table. A DataFrame can contain columns of different data types (e.g., numerical, categorical, datetime), and it supports a wide range of data manipulation operations such as merging, grouping, filtering, and aggregation.

On the other hand, a Pandas Series is a one-dimensional array-like object that can hold any data type such as integers, floats, strings, or even other objects. Each element in a Series is assigned an index label, which can be either a numerical or a string-based identifier.

In [19]:
#EXAMPLE OF DATAFRAME AND SERIES
data= {"Name":['Alice','Bob','Claire'],
      'Age':[25,30,27],
      'Gender': ['Female','Male','Female']}

my_dataframe=pd.DataFrame(data)
print(my_dataframe)
print(type(my_dataframe))
series1= pd.Series(data)
print(series1)
type(series1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
<class 'pandas.core.frame.DataFrame'>
Name        [Alice, Bob, Claire]
Age                 [25, 30, 27]
Gender    [Female, Male, Female]
dtype: object

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?


Pandas DataFrame provides a wide range of functions to manipulate data, including indexing and selecting data, filtering rows, grouping data, merging and joining datasets, reshaping data, and computing summary statistics. Here are some common functions that you can use to manipulate data in a Pandas DataFrame:

head() and tail(): To display the first or last n rows of a DataFrame. For example, df.head() will display the first 5 rows of a DataFrame df.

loc[] and iloc[]: To access and select subsets of data by label or integer location. For example, df.loc[2:4, 'column_name'] will select rows with labels from 2 to 4 and the specified column.

drop(): To remove rows or columns from a DataFrame. For example, df.drop([1,3]) will drop rows with index labels 1 and 3.

groupby(): To group data by one or more columns and compute summary statistics. For example, df.groupby('column_name').mean() will group the DataFrame by the specified column and compute the mean value for each group.

merge(): To combine two or more DataFrames based on a common column or index. For example, pd.merge(df1, df2, on='column_name') will merge two DataFrames df1 and df2 based on the common column.

pivot(): To reshape a DataFrame by converting rows to columns and vice versa. For example, df.pivot(index='column_1', columns='column_2', values='value_column') will pivot a DataFrame by creating new columns based on the values in the specified columns.

fillna(): To replace missing values with a specified value or method. For example, df.fillna(0) will replace all missing values in the DataFrame with 0.

In [20]:
#EXAMPLE:

my_dataframe.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [21]:
#EXAMPLE:

my_dataframe.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, both Series and DataFrame are mutable in nature. This means that the values in a Series or a DataFrame can be modified or updated after they have been created.

In [29]:
#Example:
import pandas as pd
data= {"Name":['Alice','Bob','Claire'],
      'Age':[25,30,27],
      'Gender': ['Female','Male','Female']}

dataframe= pd.DataFrame(data)
print(dataframe)

#NOW we can modify this data frame

dataframe.at[0,'Name']='Rajnish'
dataframe.at[0,'Gender']='Male'
print(dataframe)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
      Name  Age  Gender
0  Rajnish   25    Male
1      Bob   30    Male
2   Claire   27  Female

In [32]:
#Example :

series=pd.Series([1,2,3,4,5,67])
print(series)
series.at[5]=6
print(series)

0     1
1     2
2     3
3     4
4     5
5    67
dtype: int64
0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [49]:
#Creating multiple series
name=pd.Series(['Rajnish','Mukesh','Tipu'])
occupation=pd.Series(['Engineer','Teacher','Doctor'])
age=pd.Series([25,26,27])
#print(name,occupation,age)

#Creating data frame

df=pd.concat([name,occupation,age], axis=1)
df.columns=['name','occupation','age']
print(df)

      name occupation  age
0  Rajnish   Engineer   25
1   Mukesh    Teacher   26
2     Tipu     Doctor   27